export const shinsaShiharaiKikan = [
  {
    key: "1",
    value: "社会保険診療報酬支払基金",
  },
];

export const todofukenCodes = [
  { key: "01", value: "北海道" },
  { key: "02", value: "青森県" },
  { key: "03", value: "岩手県" },
  { key: "04", value: "宮城県" },
  { key: "05", value: "秋田県" },
  { key: "06", value: "山形県" },
  { key: "07", value: "福島県" },
  { key: "08", value: "茨城県" },
  { key: "09", value: "栃木県" },
  { key: "10", value: "群馬県" },
  { key: "11", value: "埼玉県" },
  { key: "12", value: "千葉県" },
  { key: "13", value: "東京都" },
  { key: "14", value: "神奈川県" },
  { key: "15", value: "新潟県" },
  { key: "16", value: "富山県" },
  { key: "17", value: "石川県" },
  { key: "18", value: "福井県" },
  { key: "19", value: "山梨県" },
  { key: "20", value: "長野県" },
  { key: "21", value: "岐阜県" },
  { key: "22", value: "静岡県" },
  { key: "23", value: "愛知県" },
  { key: "24", value: "三重県" },
  { key: "25", value: "滋賀県" },
  { key: "26", value: "京都府" },
  { key: "27", value: "大阪府" },
  { key: "28", value: "兵庫県" },
  { key: "29", value: "奈良県" },
  { key: "30", value: "和歌山県" },
  { key: "31", value: "鳥取県" },
  { key: "32", value: "島根県" },
  { key: "33", value: "岡山県" },
  { key: "34", value: "広島県" },
  { key: "35", value: "山口県" },
  { key: "36", value: "徳島県" },
  { key: "37", value: "香川県" },
  { key: "38", value: "愛媛県" },
  { key: "39", value: "高知県" },
  { key: "40", value: "福岡県" },
  { key: "41", value: "佐賀県" },
  { key: "42", value: "長崎県" },
  { key: "43", value: "熊本県" },
  { key: "44", value: "大分県" },
  { key: "45", value: "宮崎県" },
  { key: "46", value: "鹿児島県" },
  { key: "47", value: "沖縄県" },
];

export const tensuhyo = [
  { key: "1", value: "医科" },
  { key: "3", value: "歯科点数表" },
];

export const shisetsuKijunTodokedeCode = [
  { key: "01", value: "補管（クラウン・ブリッジ維持管理料）" },
  {
    key: "02",
    value: "歯援診（在宅療養支援歯科診療所） 平成30年3月診療以前分に限る。",
  },
  {
    key: "03",
    value: "外来環（歯科外来診療環境体制加算） 平成30年3月診療以前分に限る。",
  },
  {
    key: "04",
    value: "う蝕無痛（う蝕歯無痛的窩洞形成加算） 平成30年3月診療以前分に限る。",
  },
  {
    key: "06",
    value:
      "医管（歯科治療総合医療管理料（Ｉ）及び（Ⅱ）） 平成30年3月診療以前分に限る。",
  },
  {
    key: "07",
    value:
      "在歯管（在宅患者歯科治療総合医療管理料（Ｉ）及び（Ⅱ）） 平成30年3月診療以前分に限る。",
  },
  {
    key: "08",
    value: "特連（歯科診療特別対応連携加算） 平成30年3月診療以前分に限る。",
  },
  {
    key: "09",
    value:
      "手術歯根（手術時歯根面レーザー応用加算） 平成30年3月診療以前分に限る。",
  },
  {
    key: "10",
    value: "歯技工（歯科技工加算１及び２） 平成30年3月診療以前分に限る。",
  },
  {
    key: "13",
    value: "在推進（在宅歯科医療推進加算） 平成30年3月診療以前分に限る。",
  },
  {
    key: "14",
    value: "歯ＣＡＤ（ＣＡＤ／ＣＡＭ冠） 平成30年3月診療以前分に限る。",
  },
  {
    key: "15",
    value:
      "歯リハ２（歯科口腔リハビリテーション料２） 平成30年3月診療以前分に限る。",
  },
  {
    key: "16",
    value:
      "か強診（かかりつけ歯科医機能強化型歯科診療所） 平成30年3月診療以前分に限る。",
  },
  { key: "17", value: "歯初診（歯科初診料）" },
];

export const sex = [
  { key: "1", value: "男" },
  { key: "2", value: "女" },
];

export const receptTypeCode = [
  { key: "3111", value: "歯科・医保単独・本人・入院" },
  { key: "3112", value: "歯科・医保単独・本人・入院外" },
  { key: "3113", value: "歯科・医保単独・未就学者・入院" },
  { key: "3114", value: "歯科・医保単独・未就学者・入院外" },
  { key: "3115", value: "歯科・医保単独・家族・入院" },
  { key: "3116", value: "歯科・医保単独・家族・入院外" },
  { key: "3117", value: "歯科・医保単独・高齢受給者一般・低所得者・入院" },
  { key: "3118", value: "歯科・医保単独・高齢受給者一般・低所得者・入院外" },
  { key: "3119", value: "歯科・医保単独・高齢受給者７割・入院" },
  { key: "3110", value: "歯科・医保単独・高齢受給者７割・入院外" },
  { key: "3121", value: "歯科・医保と１種の公費併用・本人・入院" },
  { key: "3122", value: "歯科・医保と１種の公費併用・本人・入院外" },
  { key: "3123", value: "歯科・医保と１種の公費併用・未就学者・入院" },
  { key: "3124", value: "歯科・医保と１種の公費併用・未就学者・入院外" },
  { key: "3125", value: "歯科・医保と１種の公費併用・家族・入院" },
  { key: "3126", value: "歯科・医保と１種の公費併用・家族・入院外" },
  {
    key: "3127",
    value: "歯科・医保と１種の公費併用・高齢受給者一般・低所得者・入院",
  },
  {
    key: "3128",
    value: "歯科・医保と１種の公費併用・高齢受給者一般・低所得者・入院外",
  },
  { key: "3129", value: "歯科・医保と１種の公費併用・高齢受給者７割・入院" },
  { key: "3120", value: "歯科・医保と１種の公費併用・高齢受給者７割・入院外" },
  { key: "3131", value: "歯科・医保と２種の公費併用・本人・入院" },
  { key: "3132", value: "歯科・医保と２種の公費併用・本人・入院外" },
  { key: "3133", value: "歯科・医保と２種の公費併用・未就学者・入院" },
  { key: "3134", value: "歯科・医保と２種の公費併用・未就学者・入院外" },
  { key: "3135", value: "歯科・医保と２種の公費併用・家族・入院" },
  { key: "3136", value: "歯科・医保と２種の公費併用・家族・入院外" },
  {
    key: "3137",
    value: "歯科・医保と２種の公費併用・高齢受給者一般・低所得者・入院",
  },
  {
    key: "3138",
    value: "歯科・医保と２種の公費併用・高齢受給者一般・低所得者・入院外",
  },
  { key: "3139", value: "歯科・医保と２種の公費併用・高齢受給者７割・入院" },
  { key: "3130", value: "歯科・医保と２種の公費併用・高齢受給者７割・入院外" },
  { key: "3141", value: "歯科・医保と３種の公費併用・本人・入院" },
  { key: "3142", value: "歯科・医保と３種の公費併用・本人・入院外" },
  { key: "3143", value: "歯科・医保と３種の公費併用・未就学者・入院" },
  { key: "3144", value: "歯科・医保と３種の公費併用・未就学者・入院外" },
  { key: "3145", value: "歯科・医保と３種の公費併用・家族・入院" },
  { key: "3146", value: "歯科・医保と３種の公費併用・家族・入院外" },
  {
    key: "3147",
    value: "歯科・医保と３種の公費併用・高齢受給者一般・低所得者・入院",
  },
  {
    key: "3148",
    value: "歯科・医保と３種の公費併用・高齢受給者一般・低所得者・入院外",
  },
  { key: "3149", value: "歯科・医保と３種の公費併用・高齢受給者７割・入院" },
  { key: "3140", value: "歯科・医保と３種の公費併用・高齢受給者７割・入院外" },
  { key: "3151", value: "歯科・医保と４種の公費併用・本人・入院" },
  { key: "3152", value: "歯科・医保と４種の公費併用・本人・入院外" },
  { key: "3153", value: "歯科・医保と４種の公費併用・未就学者・入院" },
  { key: "3154", value: "歯科・医保と４種の公費併用・未就学者・入院外" },
  { key: "3155", value: "歯科・医保と４種の公費併用・家族・入院" },
  { key: "3156", value: "歯科・医保と４種の公費併用・家族・入院外" },
  {
    key: "3157",
    value: "歯科・医保と４種の公費併用・高齢受給者一般・低所得者・入院",
  },
  {
    key: "3158",
    value: "歯科・医保と４種の公費併用・高齢受給者一般・低所得者・入院外",
  },
  { key: "3159", value: "歯科・医保と４種の公費併用・高齢受給者７割・入院" },
  { key: "3150", value: "歯科・医保と４種の公費併用・高齢受給者７割・入院外" },
  { key: "3211", value: "歯科・公費単独・入院" },
  { key: "3212", value: "歯科・公費単独・入院外" },
  { key: "3221", value: "歯科・２種の公費併用・入院" },
  { key: "3222", value: "歯科・２種の公費併用・入院外" },
  { key: "3231", value: "歯科・３種の公費併用・入院" },
  { key: "3232", value: "歯科・３種の公費併用・入院外" },
  { key: "3241", value: "歯科・４種の公費併用・入院" },
  { key: "3242", value: "歯科・４種の公費併用・入院外" },
];

export const tenkiKubunCode = [
  { key: "1", value: "治癒、死亡、中止以外" },
  { key: "2", value: "治癒" },
  { key: "3", value: "死亡" },
  { key: "4", value: "中止（転医）または未来院請求" },
];

export const byotoKubunCode = [
  { key: "01", value: "精神（精神病棟）" },
  { key: "02", value: "結核（結核病棟）" },
  { key: "07", value: "療養（療養病棟）" },
];

export const receptTokkijikouCode = [
  { key: "01", value: "公" },
  { key: "02", value: "長" },
  { key: "03", value: "長 処" },
  { key: "04", value: "後 保" },
  { key: "07", value: "老 併" },
  { key: "08", value: "老 健" },
  { key: "09", value: "施" },
  { key: "10", value: "第 三" },
  { key: "11", value: "薬 治" },
  { key: "12", value: "器 治" },
  { key: "13", value: "先 進" },
  { key: "14", value: "制 超" },
  { key: "16", value: "長 ２" },
  { key: "20", value: "二 割" },
  { key: "21", value: "高 半" },
  { key: "25", value: "出 産" },
  { key: "26", value: "区 ア" },
  { key: "27", value: "区 イ" },
  { key: "28", value: "区 ウ" },
  { key: "29", value: "区 エ" },
  { key: "30", value: "区 オ" },
  { key: "31", value: "多 ア" },
  { key: "32", value: "多 イ" },
  { key: "33", value: "多 ウ" },
  { key: "34", value: "多 エ" },
  { key: "35", value: "多 オ" },
  { key: "36", value: "加 治" },
  { key: "37", value: "申 出" },
  { key: "38", value: "医 併" },
  { key: "39", value: "医 療" },
  { key: "40", value: "加 算" },
  { key: "41", value: "区 カ" },
  { key: "42", value: "区 キ" },
  { key: "43", value: "多 カ" },
  { key: "44", value: "多 キ" },
];

export const kanjaJotaiCode = [{ key: "001", value: "妊婦" }];

export const shokumuReasonCode = [
  { key: "1", value: "職 上（職務上）" },
  { key: "2", value: "下 ３（下船後３月以内）" },
  { key: "3", value: "通 災（通勤災害）" },
];

export const genmenKubunCode = [
  { key: "1", value: "減 額" },
  { key: "2", value: "免 除" },
  { key: "3", value: "支払猶予" },
];

export const futanshaShubetsuCode = [
  { key: "1", value: "医療保険、国民健康保険又は後期高齢者医療" },
  { key: "2", value: "第１公費負担医療" },
  { key: "3", value: "第２公費負担医療" },
  { key: "4", value: "第３公費負担医療" },
  { key: "5", value: "第４公費負担医療" },
];

export const kakuninKubunCode = [
  { key: "01", value: "保険医療機関・薬局窓口等" },
  { key: "02", value: "審査支払機関に請求後・変更なし" },
  { key: "03", value: "審査支払機関に請求後・確認不能" },
  { key: "04", value: "審査支払機関に請求後・振替" },
  { key: "05", value: "審査支払機関に請求後・分割" },
  { key: "06", value: "審査支払機関に請求後・レセプト記載の保険者等に請求" },
  { key: "07", value: "審査支払機関に請求後・資格喪失（証回収後）" },
  { key: "08", value: "審査支払機関に請求後・資格喪失（死亡）" },
  { key: "09", value: "審査支払機関に請求後・枝番特定" },
  { key: "11", value: "保険者等に請求後・振替" },
  { key: "12", value: "保険者等に請求後・分割" },
  { key: "13", value: "保険者等に請求後・変更不能" },
  { key: "14", value: "保険者等に請求後・枝番特定" },
];

export const jushinKubunCode = [
  { key: "1", value: "診療実日数に計上する受診及び入院" },
  {
    key: "2",
    value: "診療実日数に計上しない受診（初診又は再診に付随する一連の行為等）",
  },
  { key: "9", value: "請求データの各レコードに記録された算定日情報と不一致" },
];

export const madoguchiFutanKubunCode = [
  { key: "00", value: "一部負担金・高額療養費の現物給付なし" },
  {
    key: "01",
    value: "一部負担金・高額療養費現物給付あり（多数回該当を除く）",
  },
  { key: "02", value: "一部負担金・高額療養費現物給付あり（多数回該当）" },
  { key: "03", value: "食事療養費及び生活療養費の標準負担額" },
  { key: "04", value: "特別の費用の額" },
];
