export const recordType = [
  { key: "UK", value: "受付情報" },
  { key: "IR", value: "医療機関情報" },
  { key: "RE", value: "レセプト共通" },
  { key: "HO", value: "保険者" },
  { key: "KO", value: "公費" },
  { key: "SN", value: "資格確認" },
  { key: "JD", value: "受診日等" },
  { key: "MF", value: "窓口負担額" },
  { key: "HS", value: "傷病名部位" },
  { key: "SS", value: "歯科診療行為" },
];

export const shinsaShiharaiKikan = [
  {
    key: "1",
    value: "社会保険診療報酬支払基金",
  },
];

export const todofukenCodes = [
  { key: "01", value: "北海道" },
  { key: "02", value: "青森県" },
  { key: "03", value: "岩手県" },
  { key: "04", value: "宮城県" },
  { key: "05", value: "秋田県" },
  { key: "06", value: "山形県" },
  { key: "07", value: "福島県" },
  { key: "08", value: "茨城県" },
  { key: "09", value: "栃木県" },
  { key: "10", value: "群馬県" },
  { key: "11", value: "埼玉県" },
  { key: "12", value: "千葉県" },
  { key: "13", value: "東京都" },
  { key: "14", value: "神奈川県" },
  { key: "15", value: "新潟県" },
  { key: "16", value: "富山県" },
  { key: "17", value: "石川県" },
  { key: "18", value: "福井県" },
  { key: "19", value: "山梨県" },
  { key: "20", value: "長野県" },
  { key: "21", value: "岐阜県" },
  { key: "22", value: "静岡県" },
  { key: "23", value: "愛知県" },
  { key: "24", value: "三重県" },
  { key: "25", value: "滋賀県" },
  { key: "26", value: "京都府" },
  { key: "27", value: "大阪府" },
  { key: "28", value: "兵庫県" },
  { key: "29", value: "奈良県" },
  { key: "30", value: "和歌山県" },
  { key: "31", value: "鳥取県" },
  { key: "32", value: "島根県" },
  { key: "33", value: "岡山県" },
  { key: "34", value: "広島県" },
  { key: "35", value: "山口県" },
  { key: "36", value: "徳島県" },
  { key: "37", value: "香川県" },
  { key: "38", value: "愛媛県" },
  { key: "39", value: "高知県" },
  { key: "40", value: "福岡県" },
  { key: "41", value: "佐賀県" },
  { key: "42", value: "長崎県" },
  { key: "43", value: "熊本県" },
  { key: "44", value: "大分県" },
  { key: "45", value: "宮崎県" },
  { key: "46", value: "鹿児島県" },
  { key: "47", value: "沖縄県" },
];

export const tensuhyo = [
  { key: "1", value: "医科" },
  { key: "3", value: "歯科点数表" },
];

export const shisetsuKijunTodokedeCode = [
  { key: "01", value: "補管（クラウン・ブリッジ維持管理料）" },
  {
    key: "02",
    value: "歯援診（在宅療養支援歯科診療所） 平成30年3月診療以前分に限る。",
  },
  {
    key: "03",
    value: "外来環（歯科外来診療環境体制加算） 平成30年3月診療以前分に限る。",
  },
  {
    key: "04",
    value: "う蝕無痛（う蝕歯無痛的窩洞形成加算） 平成30年3月診療以前分に限る。",
  },
  {
    key: "06",
    value:
      "医管（歯科治療総合医療管理料（Ｉ）及び（Ⅱ）） 平成30年3月診療以前分に限る。",
  },
  {
    key: "07",
    value:
      "在歯管（在宅患者歯科治療総合医療管理料（Ｉ）及び（Ⅱ）） 平成30年3月診療以前分に限る。",
  },
  {
    key: "08",
    value: "特連（歯科診療特別対応連携加算） 平成30年3月診療以前分に限る。",
  },
  {
    key: "09",
    value:
      "手術歯根（手術時歯根面レーザー応用加算） 平成30年3月診療以前分に限る。",
  },
  {
    key: "10",
    value: "歯技工（歯科技工加算１及び２） 平成30年3月診療以前分に限る。",
  },
  {
    key: "13",
    value: "在推進（在宅歯科医療推進加算） 平成30年3月診療以前分に限る。",
  },
  {
    key: "14",
    value: "歯ＣＡＤ（ＣＡＤ／ＣＡＭ冠） 平成30年3月診療以前分に限る。",
  },
  {
    key: "15",
    value:
      "歯リハ２（歯科口腔リハビリテーション料２） 平成30年3月診療以前分に限る。",
  },
  {
    key: "16",
    value:
      "か強診（かかりつけ歯科医機能強化型歯科診療所） 平成30年3月診療以前分に限る。",
  },
  { key: "17", value: "歯初診（歯科初診料）" },
];

export const sex = [
  { key: "1", value: "男" },
  { key: "2", value: "女" },
];

export const receptTypeCode = [
  { key: "3111", value: "歯科・医保単独・本人・入院" },
  { key: "3112", value: "歯科・医保単独・本人・入院外" },
  { key: "3113", value: "歯科・医保単独・未就学者・入院" },
  { key: "3114", value: "歯科・医保単独・未就学者・入院外" },
  { key: "3115", value: "歯科・医保単独・家族・入院" },
  { key: "3116", value: "歯科・医保単独・家族・入院外" },
  { key: "3117", value: "歯科・医保単独・高齢受給者一般・低所得者・入院" },
  { key: "3118", value: "歯科・医保単独・高齢受給者一般・低所得者・入院外" },
  { key: "3119", value: "歯科・医保単独・高齢受給者７割・入院" },
  { key: "3110", value: "歯科・医保単独・高齢受給者７割・入院外" },
  { key: "3121", value: "歯科・医保と１種の公費併用・本人・入院" },
  { key: "3122", value: "歯科・医保と１種の公費併用・本人・入院外" },
  { key: "3123", value: "歯科・医保と１種の公費併用・未就学者・入院" },
  { key: "3124", value: "歯科・医保と１種の公費併用・未就学者・入院外" },
  { key: "3125", value: "歯科・医保と１種の公費併用・家族・入院" },
  { key: "3126", value: "歯科・医保と１種の公費併用・家族・入院外" },
  {
    key: "3127",
    value: "歯科・医保と１種の公費併用・高齢受給者一般・低所得者・入院",
  },
  {
    key: "3128",
    value: "歯科・医保と１種の公費併用・高齢受給者一般・低所得者・入院外",
  },
  { key: "3129", value: "歯科・医保と１種の公費併用・高齢受給者７割・入院" },
  { key: "3120", value: "歯科・医保と１種の公費併用・高齢受給者７割・入院外" },
  { key: "3131", value: "歯科・医保と２種の公費併用・本人・入院" },
  { key: "3132", value: "歯科・医保と２種の公費併用・本人・入院外" },
  { key: "3133", value: "歯科・医保と２種の公費併用・未就学者・入院" },
  { key: "3134", value: "歯科・医保と２種の公費併用・未就学者・入院外" },
  { key: "3135", value: "歯科・医保と２種の公費併用・家族・入院" },
  { key: "3136", value: "歯科・医保と２種の公費併用・家族・入院外" },
  {
    key: "3137",
    value: "歯科・医保と２種の公費併用・高齢受給者一般・低所得者・入院",
  },
  {
    key: "3138",
    value: "歯科・医保と２種の公費併用・高齢受給者一般・低所得者・入院外",
  },
  { key: "3139", value: "歯科・医保と２種の公費併用・高齢受給者７割・入院" },
  { key: "3130", value: "歯科・医保と２種の公費併用・高齢受給者７割・入院外" },
  { key: "3141", value: "歯科・医保と３種の公費併用・本人・入院" },
  { key: "3142", value: "歯科・医保と３種の公費併用・本人・入院外" },
  { key: "3143", value: "歯科・医保と３種の公費併用・未就学者・入院" },
  { key: "3144", value: "歯科・医保と３種の公費併用・未就学者・入院外" },
  { key: "3145", value: "歯科・医保と３種の公費併用・家族・入院" },
  { key: "3146", value: "歯科・医保と３種の公費併用・家族・入院外" },
  {
    key: "3147",
    value: "歯科・医保と３種の公費併用・高齢受給者一般・低所得者・入院",
  },
  {
    key: "3148",
    value: "歯科・医保と３種の公費併用・高齢受給者一般・低所得者・入院外",
  },
  { key: "3149", value: "歯科・医保と３種の公費併用・高齢受給者７割・入院" },
  { key: "3140", value: "歯科・医保と３種の公費併用・高齢受給者７割・入院外" },
  { key: "3151", value: "歯科・医保と４種の公費併用・本人・入院" },
  { key: "3152", value: "歯科・医保と４種の公費併用・本人・入院外" },
  { key: "3153", value: "歯科・医保と４種の公費併用・未就学者・入院" },
  { key: "3154", value: "歯科・医保と４種の公費併用・未就学者・入院外" },
  { key: "3155", value: "歯科・医保と４種の公費併用・家族・入院" },
  { key: "3156", value: "歯科・医保と４種の公費併用・家族・入院外" },
  {
    key: "3157",
    value: "歯科・医保と４種の公費併用・高齢受給者一般・低所得者・入院",
  },
  {
    key: "3158",
    value: "歯科・医保と４種の公費併用・高齢受給者一般・低所得者・入院外",
  },
  { key: "3159", value: "歯科・医保と４種の公費併用・高齢受給者７割・入院" },
  { key: "3150", value: "歯科・医保と４種の公費併用・高齢受給者７割・入院外" },
  { key: "3211", value: "歯科・公費単独・入院" },
  { key: "3212", value: "歯科・公費単独・入院外" },
  { key: "3221", value: "歯科・２種の公費併用・入院" },
  { key: "3222", value: "歯科・２種の公費併用・入院外" },
  { key: "3231", value: "歯科・３種の公費併用・入院" },
  { key: "3232", value: "歯科・３種の公費併用・入院外" },
  { key: "3241", value: "歯科・４種の公費併用・入院" },
  { key: "3242", value: "歯科・４種の公費併用・入院外" },
];

export const tenkiKubunCode = [
  { key: "1", value: "治癒、死亡、中止以外" },
  { key: "2", value: "治癒" },
  { key: "3", value: "死亡" },
  { key: "4", value: "中止（転医）または未来院請求" },
];

export const byotoKubunCode = [
  { key: "01", value: "精神（精神病棟）" },
  { key: "02", value: "結核（結核病棟）" },
  { key: "07", value: "療養（療養病棟）" },
];

export const receptTokkijikouCode = [
  { key: "01", value: "公" },
  { key: "02", value: "長" },
  { key: "03", value: "長 処" },
  { key: "04", value: "後 保" },
  { key: "07", value: "老 併" },
  { key: "08", value: "老 健" },
  { key: "09", value: "施" },
  { key: "10", value: "第 三" },
  { key: "11", value: "薬 治" },
  { key: "12", value: "器 治" },
  { key: "13", value: "先 進" },
  { key: "14", value: "制 超" },
  { key: "16", value: "長 ２" },
  { key: "20", value: "二 割" },
  { key: "21", value: "高 半" },
  { key: "25", value: "出 産" },
  { key: "26", value: "区 ア" },
  { key: "27", value: "区 イ" },
  { key: "28", value: "区 ウ" },
  { key: "29", value: "区 エ" },
  { key: "30", value: "区 オ" },
  { key: "31", value: "多 ア" },
  { key: "32", value: "多 イ" },
  { key: "33", value: "多 ウ" },
  { key: "34", value: "多 エ" },
  { key: "35", value: "多 オ" },
  { key: "36", value: "加 治" },
  { key: "37", value: "申 出" },
  { key: "38", value: "医 併" },
  { key: "39", value: "医 療" },
  { key: "40", value: "加 算" },
  { key: "41", value: "区 カ" },
  { key: "42", value: "区 キ" },
  { key: "43", value: "多 カ" },
  { key: "44", value: "多 キ" },
];

export const kanjaJotaiCode = [{ key: "001", value: "妊婦" }];

export const shokumuReasonCode = [
  { key: "1", value: "職 上（職務上）" },
  { key: "2", value: "下 ３（下船後３月以内）" },
  { key: "3", value: "通 災（通勤災害）" },
];

export const genmenKubunCode = [
  { key: "1", value: "減 額" },
  { key: "2", value: "免 除" },
  { key: "3", value: "支払猶予" },
];

export const futanshaShubetsuCode = [
  { key: "1", value: "医療保険、国民健康保険又は後期高齢者医療" },
  { key: "2", value: "第１公費負担医療" },
  { key: "3", value: "第２公費負担医療" },
  { key: "4", value: "第３公費負担医療" },
  { key: "5", value: "第４公費負担医療" },
];

export const kakuninKubunCode = [
  { key: "01", value: "保険医療機関・薬局窓口等" },
  { key: "02", value: "審査支払機関に請求後・変更なし" },
  { key: "03", value: "審査支払機関に請求後・確認不能" },
  { key: "04", value: "審査支払機関に請求後・振替" },
  { key: "05", value: "審査支払機関に請求後・分割" },
  { key: "06", value: "審査支払機関に請求後・レセプト記載の保険者等に請求" },
  { key: "07", value: "審査支払機関に請求後・資格喪失（証回収後）" },
  { key: "08", value: "審査支払機関に請求後・資格喪失（死亡）" },
  { key: "09", value: "審査支払機関に請求後・枝番特定" },
  { key: "11", value: "保険者等に請求後・振替" },
  { key: "12", value: "保険者等に請求後・分割" },
  { key: "13", value: "保険者等に請求後・変更不能" },
  { key: "14", value: "保険者等に請求後・枝番特定" },
];

export const jushinKubunCode = [
  { key: "1", value: "診療実日数に計上する受診及び入院" },
  {
    key: "2",
    value: "診療実日数に計上しない受診（初診又は再診に付随する一連の行為等）",
  },
  { key: "9", value: "請求データの各レコードに記録された算定日情報と不一致" },
];

export const madoguchiFutanKubunCode = [
  { key: "00", value: "一部負担金・高額療養費の現物給付なし" },
  {
    key: "01",
    value: "一部負担金・高額療養費現物給付あり（多数回該当を除く）",
  },
  { key: "02", value: "一部負担金・高額療養費現物給付あり（多数回該当）" },
  { key: "03", value: "食事療養費及び生活療養費の標準負担額" },
  { key: "04", value: "特別の費用の額" },
];

export const toothTypeCode = [
  { key: "1000", value: "口腔全体" },
  { key: "1001", value: "上顎歯列" },
  { key: "1002", value: "下顎歯列" },
  { key: "1003", value: "右側上顎臼歯" },
  { key: "1004", value: "上顎前歯" },
  { key: "1005", value: "左側上顎臼歯" },
  { key: "1006", value: "左側下顎臼歯" },
  { key: "1007", value: "下顎前歯" },
  { key: "1008", value: "右側下顎臼歯" },
  { key: "1010", value: "右上顎歯列" },
  { key: "1020", value: "左上顎歯列" },
  { key: "1030", value: "左下顎歯列" },
  { key: "1040", value: "右下顎歯列" },
  { key: "1011", value: "右側上顎中切歯" },
  { key: "1012", value: "右側上顎側切歯" },
  { key: "1013", value: "右側上顎犬歯" },
  { key: "1014", value: "右側上顎第１小臼歯" },
  { key: "1015", value: "右側上顎第２小臼歯" },
  { key: "1016", value: "右側上顎第１大臼歯" },
  { key: "1017", value: "右側上顎第２大臼歯" },
  { key: "1018", value: "右側上顎第３大臼歯" },
  { key: "1021", value: "左側上顎中切歯" },
  { key: "1022", value: "左側上顎側切歯" },
  { key: "1023", value: "左側上顎犬歯" },
  { key: "1024", value: "左側上顎第１小臼歯" },
  { key: "1025", value: "左側上顎第２小臼歯" },
  { key: "1026", value: "左側上顎第１大臼歯" },
  { key: "1027", value: "左側上顎第２大臼歯" },
  { key: "1028", value: "左側上顎第３大臼歯" },
  { key: "1031", value: "左側下顎中切歯" },
  { key: "1032", value: "左側下顎側切歯" },
  { key: "1033", value: "左側下顎犬歯" },
  { key: "1034", value: "左側下顎第１小臼歯" },
  { key: "1035", value: "左側下顎第２小臼歯" },
  { key: "1036", value: "左側下顎第１大臼歯" },
  { key: "1037", value: "左側下顎第２大臼歯" },
  { key: "1038", value: "左側下顎第３大臼歯" },
  { key: "1041", value: "右側下顎中切歯" },
  { key: "1042", value: "右側下顎側切歯" },
  { key: "1043", value: "右側下顎犬歯" },
  { key: "1044", value: "右側下顎第１小臼歯" },
  { key: "1045", value: "右側下顎第２小臼歯" },
  { key: "1046", value: "右側下顎第１大臼歯" },
  { key: "1047", value: "右側下顎第２大臼歯" },
  { key: "1048", value: "右側下顎第３大臼歯" },
  { key: "1051", value: "右側上顎乳中切歯" },
  { key: "1052", value: "右側上顎乳側切歯" },
  { key: "1053", value: "右側上顎乳犬歯" },
  { key: "1054", value: "右側上顎第１乳臼歯" },
  { key: "1055", value: "右側上顎第２乳臼歯" },
  { key: "1061", value: "左側上顎乳中切歯" },
  { key: "1062", value: "左側上顎乳側切歯" },
  { key: "1063", value: "左側上顎乳犬歯" },
  { key: "1064", value: "左側上顎第１乳臼歯" },
  { key: "1065", value: "左側上顎第２乳臼歯" },
  { key: "1071", value: "左側下顎乳中切歯" },
  { key: "1072", value: "左側下顎乳側切歯" },
  { key: "1073", value: "左側下顎乳犬歯" },
  { key: "1074", value: "左側下顎第１乳臼歯" },
  { key: "1075", value: "左側下顎第２乳臼歯" },
  { key: "1081", value: "右側下顎乳中切歯" },
  { key: "1082", value: "右側下顎乳側切歯" },
  { key: "1083", value: "右側下顎乳犬歯" },
  { key: "1084", value: "右側下顎第１乳臼歯" },
  { key: "1085", value: "右側下顎第２乳臼歯" },
  { key: "101A", value: "右側上顎中切歯近傍過剰歯" },
  { key: "101B", value: "右側上顎側切歯近傍過剰歯" },
  { key: "101C", value: "右側上顎犬歯近傍過剰歯" },
  { key: "101D", value: "右側上顎第１小臼歯近傍過剰歯" },
  { key: "101E", value: "右側上顎第２小臼歯近傍過剰歯" },
  { key: "101F", value: "右側上顎第１大臼歯近傍過剰歯" },
  { key: "101G", value: "右側上顎第２大臼歯近傍過剰歯" },
  { key: "101H", value: "右側上顎第３大臼歯近傍過剰歯" },
  { key: "102A", value: "左側上顎中切歯近傍過剰歯" },
  { key: "102B", value: "左側上顎側切歯近傍過剰歯" },
  { key: "102C", value: "左側上顎犬歯近傍過剰歯" },
  { key: "102D", value: "左側上顎第１小臼歯近傍過剰歯" },
  { key: "102E", value: "左側上顎第２小臼歯近傍過剰歯" },
  { key: "102F", value: "左側上顎第１大臼歯近傍過剰歯" },
  { key: "102G", value: "左側上顎第２大臼歯近傍過剰歯" },
  { key: "102H", value: "左側上顎第３大臼歯近傍過剰歯" },
  { key: "103A", value: "左側下顎中切歯近傍過剰歯" },
  { key: "103B", value: "左側下顎側切歯近傍過剰歯" },
  { key: "103C", value: "左側下顎犬歯近傍過剰歯" },
  { key: "103D", value: "左側下顎第１小臼歯近傍過剰歯" },
  { key: "103E", value: "左側下顎第２小臼歯近傍過剰歯" },
  { key: "103F", value: "左側下顎第１大臼歯近傍過剰歯" },
  { key: "103G", value: "左側下顎第２大臼歯近傍過剰歯" },
  { key: "103H", value: "左側下顎第３大臼歯近傍過剰歯" },
  { key: "104A", value: "右側下顎中切歯近傍過剰歯" },
  { key: "104B", value: "右側下顎側切歯近傍過剰歯" },
  { key: "104C", value: "右側下顎犬歯近傍過剰歯" },
  { key: "104D", value: "右側下顎第１小臼歯近傍過剰歯" },
  { key: "104E", value: "右側下顎第２小臼歯近傍過剰歯" },
  { key: "104F", value: "右側下顎第１大臼歯近傍過剰歯" },
  { key: "104G", value: "右側下顎第２大臼歯近傍過剰歯" },
  { key: "104H", value: "右側下顎第３大臼歯近傍過剰歯" },
  { key: "105A", value: "右側上顎乳中切歯近傍過剰歯" },
  { key: "105B", value: "右側上顎乳側切歯近傍過剰歯" },
  { key: "105C", value: "右側上顎乳犬歯近傍過剰歯" },
  { key: "105D", value: "右側上顎第１乳臼歯近傍過剰歯" },
  { key: "105E", value: "右側上顎第２乳臼歯近傍過剰歯" },
  { key: "106A", value: "左側上顎乳中切歯近傍過剰歯" },
  { key: "106B", value: "左側上顎乳側切歯近傍過剰歯" },
  { key: "106C", value: "左側上顎乳犬歯近傍過剰歯" },
  { key: "106D", value: "左側上顎第１乳臼歯近傍過剰歯" },
  { key: "106E", value: "左側上顎第２乳臼歯近傍過剰歯" },
  { key: "107A", value: "左側下顎乳中切歯近傍過剰歯" },
  { key: "107B", value: "左側下顎乳側切歯近傍過剰歯" },
  { key: "107C", value: "左側下顎乳犬歯近傍過剰歯" },
  { key: "107D", value: "左側下顎第１乳臼歯近傍過剰歯" },
  { key: "107E", value: "左側下顎第２乳臼歯近傍過剰歯" },
  { key: "108A", value: "右側下顎乳中切歯近傍過剰歯" },
  { key: "108B", value: "右側下顎乳側切歯近傍過剰歯" },
  { key: "108C", value: "右側下顎乳犬歯近傍過剰歯" },
  { key: "108D", value: "右側下顎第１乳臼歯近傍過剰歯" },
  { key: "108E", value: "右側下顎第２乳臼歯近傍過剰歯" },
];

export const toothStatusCode = [
  { key: "0", value: "現存歯" },
  { key: "1", value: "対象のみを表示（部位のみを示す場合に使用）" },
  { key: "2", value: "欠損歯" },
  { key: "3", value: "支台歯" },
  { key: "4", value: "分割抜歯支台（根）" },
  { key: "5", value: "便宜抜髄支台歯" },
  { key: "6", value: "残根" },
  { key: "7", value: "部インプラント" },
  { key: "8", value: "部近心隙" },
  { key: "9", value: "近心位に存在" },
];

export const toothPartCode = [
  { key: "0", value: "" },
  { key: "1", value: "遠心頬側根" },
  { key: "2", value: "近心頬側根" },
  { key: "3", value: "近心頬側根および遠心頬側根" },
  { key: "4", value: "舌側（口蓋）根" },
  { key: "5", value: "舌側（口蓋）根および遠心頬側根" },
  { key: "6", value: "舌側（口蓋）根および近心頬側根" },
  { key: "7", value: "遠心根" },
  { key: "8", value: "近心根" },
];

export const byotaiIkouCode = [
  { key: "1", value: "病態移行前" },
  { key: "2", value: "病態移行後" },
];

export const shinryoShikibetsuCode = [
  { key: "01", value: "全体に係る識別コード" },
  { key: "11", value: "初診" },
  { key: "12", value: "再診" },
  { key: "13", value: "管理・リハ" },
  { key: "14", value: "在宅" },
  { key: "21", value: "投薬（内服）" },
  { key: "22", value: "投薬（屯服）" },
  { key: "23", value: "投薬（外用）" },
  { key: "24", value: "調剤" },
  { key: "26", value: "麻毒" },
  { key: "27", value: "調基" },
  { key: "31", value: "注射（皮下筋肉内）" },
  { key: "32", value: "注射（静脈内）" },
  { key: "33", value: "注射（その他）" },
  { key: "39", value: "薬剤料減点" },
  { key: "40", value: "処置" },
  { key: "41", value: "処置・手術１" },
  { key: "42", value: "処置・手術２" },
  { key: "43", value: "処置・手術３" },
  { key: "44", value: "処置・手術（その他）" },
  { key: "50", value: "手術" },
  { key: "54", value: "麻酔" },
  { key: "60", value: "検査・病理" },
  { key: "61", value: "歯冠修復・欠損補綴（修復・補綴１）" },
  { key: "62", value: "歯冠修復・欠損補綴（修復・補綴２）" },
  { key: "63", value: "歯冠修復・欠損補綴（修復・補綴３）" },
  { key: "64", value: "歯冠修復・欠損補綴（その他）" },
  { key: "70", value: "画像診断" },
  { key: "80", value: "その他" },
  { key: "90", value: "入院基本料" },
  { key: "92", value: "特定入院料・その他" },
  { key: "97", value: "食事療養・生活療養・標準負担額" },
  { key: "99", value: "全体に係る識別コード" },
];

export const futanKubunCode = [
  {
    key: "1",
    value: "医保",
  },
  {
    key: "5",
    value: "公費①",
  },
  {
    key: "6",
    value: "公費②",
  },
  {
    key: "B",
    value: "公費③",
  },
  {
    key: "C",
    value: "公費④",
  },
  {
    key: "2",
    value: "医保, 公費①",
  },
  {
    key: "3",
    value: "医保, 公費②",
  },
  {
    key: "E",
    value: "医保, 公費③",
  },
  {
    key: "G",
    value: "医保, 公費④",
  },
  {
    key: "7",
    value: "公費①, 公費②",
  },
  {
    key: "H",
    value: "公費①, 公費③",
  },
  {
    key: "I",
    value: "公費①, 公費④",
  },
  {
    key: "J",
    value: "公費②, 公費③",
  },
  {
    key: "K",
    value: "公費②, 公費④",
  },
  {
    key: "L",
    value: "公費③, 公費④",
  },
  {
    key: "4",
    value: "医保, 公費①, 公費②",
  },
  {
    key: "M",
    value: "医保, 公費①, 公費③",
  },
  {
    key: "N",
    value: "医保, 公費①, 公費④",
  },
  {
    key: "O",
    value: "医保, 公費②, 公費③",
  },
  {
    key: "P",
    value: "医保, 公費②, 公費④",
  },
  {
    key: "Q",
    value: "医保, 公費③, 公費④",
  },
  {
    key: "R",
    value: "公費①, 公費②, 公費③",
  },
  {
    key: "S",
    value: "公費①, 公費②, 公費④",
  },
  {
    key: "T",
    value: "公費①, 公費③, 公費④",
  },
  {
    key: "U",
    value: "公費②, 公費③, 公費④",
  },
  {
    key: "V",
    value: "医保, 公費①, 公費②, 公費③",
  },
  {
    key: "W",
    value: "医保, 公費①, 公費②, 公費④",
  },
  {
    key: "X",
    value: "医保, 公費①, 公費③, 公費④",
  },
  {
    key: "Y",
    value: "医保, 公費②, 公費③, 公費④",
  },
  {
    key: "Z",
    value: "公費①, 公費②, 公費③, 公費④",
  },
  {
    key: "9",
    value: "医保, 公費①, 公費②, 公費③, 公費④",
  },
];

export const iyakuhinKubunCode = [
  { key: "1", value: "内服薬剤" },
  { key: "2", value: "屯服薬剤" },
  { key: "3", value: "外用薬剤" },
  { key: "4", value: "注射薬剤" },
  { key: "5", value: "麻酔・処置・手術等で使用する薬剤（６・７以外）" },
  { key: "6", value: "歯科麻酔薬剤" },
  { key: "7", value: "特定薬剤" },
];

export const tokuteiKizaiKasanCode = [
  { key: "770020070", value: "酸素補正率（1.3）" },
  { key: "770030070", value: "高気圧酸素加算（※要治療に係る気圧数）" },
  { key: "799990070", value: "フィルム料 6歳未満乳幼児加算" },
];

export const _mojiDataPattern = [
  {
    key: "10",
    value: "任意の文字列情報を記録する。医療機関が記録した文字列を表示する",
  },
  {
    key: "20",
    value:
      "記録しない。コメントマスターの「漢字名称（項番７）」のコメント文を表示する",
  },
  {
    key: "30",
    value:
      "一部の文字列情報を記録する。コメントマスターの「漢字名称（項番７）」のコメント文の後に医療機関が記録した文字列を表示する",
  },
  {
    key: "31",
    value:
      "診療行為コード（医科）を記録する（全角数字）。コメントマスターの「漢字名称（項番７）」のコメント文の後に医療機関が記録した診療行為コードを翻訳して表示する",
  },
  {
    key: "40",
    value:
      "一部の数字情報を記録する（全角数字）。コメントマスターの「漢字名称（項番７）」のコメント文に医療機関が記録した数字を埋め込んで表示する",
  },
  {
    key: "42",
    value:
      "一部の数字情報等を記録する（全角数字、全角「.」（ドット）、全角「－」（マイナス）及び全角「＋」（プラス））。コメントマスターの「漢字名称（項番７）」のコメント文の後に医療機関が記録した数字等を表示する",
  },
  {
    key: "50",
    value:
      "一部の数字情報を記録する（全角数字）。コメントマスターの「漢字名称（項番７）」のコメント文の後に医療機関が記録した数字に「年月日」を付加して表示する",
  },
  {
    key: "51",
    value:
      "一部の数字情報を記録する（全角数字）。コメントマスターの「漢字名称（項番７）」のコメント文の後に医療機関が記録した数字に「時分」を付加して表示する",
  },
  {
    key: "52",
    value:
      "一部の数字情報を記録する（全角数字）。コメントマスターの「漢字名称（項番７）」のコメント文の後に医療機関が記録した数字に「分」を付加して表示する",
  },
  {
    key: "53",
    value:
      "一部の数字情報を記録する（全角数字）。コメントマスターの「漢字名称（項番７）」のコメント文の後に医療機関が記録した数字に「日時分」を付加して表示する",
  },
  {
    key: "80",
    value:
      "一部の数字情報等を記録する（全角数字、全角「.」（ドット））。コメントマスターの「漢字名称（項番７）」のコメント文の後に医療機関が記録した数字等に「年月日」及び「検査値：」を付加して表示する",
  },
  {
    key: "90",
    value:
      "修飾語（部位）コードを記録する（全角数字）。※複数記録可能（複数記録する場合、続けて記録）。医療機関が記録した修飾語コードを翻訳して表示する",
  },
];
